Catalogs/КассыККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>КассыККМ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИспользоватьБезПодключенияОборудования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодключаемоеОборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодключаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКассы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКассККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОборудования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПодключаемогоОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипыПодключаемогоОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыПодключаемогоОборудования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СканерШтрихкода</Name>
					<Comment>Scanner</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчитывательМагнитныхКарт</Name>
					<Comment>MSR</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ККТ</Name>
					<Comment>KKT</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФискальныйРегистратор</Name>
					<Comment>FiscalPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринтерЧеков</Name>
					<Comment>ReceiptPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДисплейПокупателя</Name>
					<Comment>LineDisplay</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТерминалСбораДанных</Name>
					<Comment>DataCollectionTerminal</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭквайринговыйТерминал</Name>
					<Comment>AcquiringTerminal</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронныеВесы</Name>
					<Comment>Scale</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВесыСПечатьюЭтикеток</Name>
					<Comment>ScaleOffline</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ККМОфлайн</Name>
					<Comment>ECROffline</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринтерЭтикеток</Name>
					<Comment>LabelPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчитывательRFID</Name>
					<Comment>RFID</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьWebСервисОборудование</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыКассККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыКассККМ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ФискальныйРегистратор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвтономнаяККМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ККМOffline</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/КассыККМ/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если НЕ ЭтоГруппа Тогда
		
		Если НЕ ПодключаемоеОборудование.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ Тогда
			//ЭлектронныйЧекSMSПередаютсяПрограммой1С   = Ложь;
			//ЭлектронныйЧекEmailПередаютсяПрограммой1С = Ложь;
		КонецЕсли;
		
		//Если ТипКассы = Перечисления.ТипыКассККМ.ККМOffline Тогда
		//	Возврат;
		//КонецЕсли;

		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КассыККМ.Ссылка.Наименование КАК Наименование
		|ИЗ
		|	Справочник.КассыККМ КАК КассыККМ
		|ГДЕ
		|	КассыККМ.Магазин = &Магазин
		|	И НЕ (КассыККМ.ТипКассы = ЗНАЧЕНИЕ(Перечисление.ТипыКассККМ.ККМOffline))
		|	И КассыККМ.Владелец = &Владелец
		|	И КассыККМ.РабочееМесто = &РабочееМесто
		|	И НЕ КассыККМ.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Магазин", Магазин);
		Запрос.УстановитьПараметр("Владелец", Владелец);
		Запрос.УстановитьПараметр("РабочееМесто", РабочееМесто);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Результат = Запрос.Выполнить();
		
		Выборка = Результат.Выбрать();
		
		Если Выборка.Следующий() Тогда
		
			Отказ = Истина;
			СтрокаСообщения = НСтр("ru = 'Касса с такими же параметрами уже существует
										 |" + Выборка.Наименование + " :
										 |Магазин      - " + Магазин + "
										 |Организация  - " + Владелец + "
										 |РабочееМесто - " + РабочееМесто + "'"); 
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаСообщения)
		КонецЕсли;
		
		ТипОборудования = ПодключаемоеОборудование.ТипОборудования;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		ДанныеЗаполнения.Свойство("Владелец", Владелец);
		ДанныеЗаполнения.Свойство("Магазин", Магазин);
	КонецЕсли;
	
	ИспользоватьБезПодключенияОборудования = НЕ ПолучитьФункциональнуюОпцию("ИспользоватьПодключаемоеОборудование");
	
	Если ИспользоватьБезПодключенияОборудования Тогда
		ТипКассы = Перечисления.ТипыКассККМ.АвтономнаяККМ
	ИначеЕсли ТипКассы = Перечисления.ТипыКассККМ.ПустаяСсылка() Тогда
		ТипКассы = Перечисления.ТипыКассККМ.ФискальныйРегистратор;
	КонецЕсли;
	
	//Если ТипКассы = Перечисления.ТипыКассККМ.ФискальныйРегистратор Тогда
	//	НастройкаРаспределенияВыручкиПоСекциям = Справочники.НастройкиРаспределенияВыручкиПоСекциямФР.РаспределениеПоУмолчанию;
	//КонецЕсли;
	
	//ОбщегоНазначенияРТ.ПроверитьИспользованиеОрганизации(,,Владелец);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	Если ИспользоватьБезПодключенияОборудования Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ТипОборудования");
		МассивНепроверяемыхРеквизитов.Добавить("ПодключаемоеОборудование");
	Иначе
		Если ЗначениеЗаполнено(ПодключаемоеОборудование) Тогда
			Если ЗначениеЗаполнено(ТипОборудования) Тогда
				Если ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ
					ИЛИ ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ПринтерЧеков Тогда
					//УправлениеШаблонами.ПроверитьТипШаблона(ЭтотОбъект, "ШаблонЧекаККМ", Перечисления.ТипыШаблонов.ЧекККТ, Отказ);
					//УправлениеШаблонами.ПроверитьТипШаблона(ЭтотОбъект, "ШаблонЧекаККМВозврат", Перечисления.ТипыШаблонов.ЧекККТ, Отказ);
				ИначеЕсли ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ФискальныйРегистратор Тогда
					//УправлениеШаблонами.ПроверитьТипШаблона(ЭтотОбъект, "ШаблонЧекаККМ", Перечисления.ТипыШаблонов.ФискальныйЧек, Отказ);
					//УправлениеШаблонами.ПроверитьТипШаблона(ЭтотОбъект, "ШаблонЧекаККМВозврат", Перечисления.ТипыШаблонов.ФискальныйЧек, Отказ);
				КонецЕсли;
			Иначе
				ТекстСообщения = НСтр("ru = 'У выбранного оборудования не определен тип'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					ТекстСообщения,
					ЭтотОбъект,
					"ПодключаемоеОборудование",
					"Объект",
					Отказ);
			КонецЕсли;
		Иначе
			МассивНепроверяемыхРеквизитов.Добавить("ТипОборудования");
		КонецЕсли;
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
